// 1. Ціле десяткове число 12 з мінімально необхідною розрядною сіткою
let number1: Int8 = 12
print("1. Int8 число 12: \(number1)")

// 2. Ціле десяткове число -100 з мінімально необхідною розрядною сіткою
let number2: Int8 = -100
print("2. Int8 число -100: \(number2)")

// 3. Ціле шістнадцяткове число, що рівне цілому десятковому числу 128
let number3: UInt8 = 0x80 // 128 в шістнадцятковій системі
print("3. UInt8 число 0x80 (128 в десятковій): \(number3)")

// 4. Мінімальне десяткове значення числа, яке знаходиться у межах 16-розрядної сітки
let number4 = Int16.min
print("4. Мінімальне Int16 число: \(number4)")

// 5. Максимальне десяткове значення числа, яке знаходиться у межах 64-розрядної сітки
let number5 = Int64.max
print("5. Максимальне Int64 число: \(number5)")

// 6. Число з плавачою крапкою 10,235.34 з мінімально необхідною розрядною сіткою
let number6: Float = 10_235.34
print("6. Float число 10235.34: \(number6)")

// 7. Символ "а"
let char: Character = "a"
print("7. Символ 'a': \(char)")

// 8. Рядок "Hello World"
let string: String = "Hello World"
print("8. Рядок: \(string)")

// 9. Істина
let boolean: Bool = true
print("9. Логічне значення true: \(boolean)")

// 10. Число 12 та його рядкове представлення "twelve"
let number: Int = 12
let numberString: String = "twelve"
print("10. Число 12 як Int: \(number), та його рядкове представлення: \(numberString)")
